/*Task 7. Lift MainLift.
Будем считать, что все люди в дом попадают только через лифт, убывают тем же способом.
Поля объекта Lift  не менять напрямую.(только через метод)
На первом этаже тех этаж(тут люди не живут).
Поля: 
 - текущий этаж
 - общее количество этажей перемещения
 - общее количество перевезенных людей
 - количество людей находящихся в данный момент в доме.
У лифта методы: 
    - метод перемещения лифта с номером этажа для перемещения nextFloor и 
    количеством человек countHuman: move(int nextFloor, int countHuman)
 - метод выводящий состояние лифта(значение всех полей объекта):printAboutMe()
В главном классе создать объект лифта, и вызвать 10 раз метод move (с рандомными значениями) и после каждого перемещения
 вызываем метод printAboutMe. */
package week1.lesson2;

public class Task7 {

}
//done