/*Task4. Написать код для заполнения ArrayList и Vector 10000 элементами 
числами от (1, 2, 3, 4, ..., 999, 10000).Заполнять отдельными потоками,
каждый поток заполняет только по 1000 элементов.
 Посчитать скорость заполнения для ArrayList и для Vector.

Task5. Написать код для многопоточного подсчета суммы элементов набора 
Vector и ArrayList из целых чисел. Каждый поток может считать 
 только 1000 элементов. 
 Посчитать скорость выполнения для ArrayList и для Vector.

Task 6. Создать класс Product(name, code,price, kol, date), Shop(ArrayList<Product>).
Добавить в магазин 10000 продуктов со случайными значениями полей.
Написать методы:
 1) Реализовать метод двоичного поиска товара по коду
 2) Подсчет суммы всех товаров(price*kol) с помощью создания 10 потоков, каждый из которых считает по 1000 элементов в списке
 3) Реализовать метод сортировки товаров в магазине по коду
 4) Реализовать метод сортировки товаров в магазине по дате закупки
 5) Реализовать метод двоичного поиска товара по дате закупки
 6) Создать два исключения: NullProductByDateException и NullProductByCodeException
*/
package week6.lesson12;

public class Task4 {

}
